Revit 2027 API
ParameterTypeId.SteelElemProfileType Property
 "Profile Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemProfileType { get; }
Public Shared ReadOnly Property SteelElemProfileType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemProfileType {
	ForgeTypeId^ get ();
}
static member SteelElemProfileType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace